### Pair Programming Pandas I

1. ¿Qué diferencia hay entre una Serie y un DataFrame?

In [12]:
print('Una serie es un array unidimensional que tiene dos tipos de valores, índice y vector, mientras que un dataframe tiene dos dimensiones y en él pueden guardarse todo tipo de datos.')

Una serie es un array unidimensional que tiene dos tipos de valores, índice y vector, mientras que un dataframe tiene dos dimensiones y en él pueden guardarse todo tipo de datos.

In [13]:
# Importamos las librerías necesarias:

import pandas as pd
import numpy as np
import random
import os
from os import getcwd

1. Crea dos listas:
- Una que se llame "valores" que tenga 7 números aleatorios.

In [14]:
def lista_generador(n):
      lista = [0]  * n
      for i in range(n):
          lista[i] = random.randint(0, 100)
      return lista

valores = lista_generador(7)


Otra que se llame "indices" que tenga 7 strings que se llamen como los días de la semana.

In [15]:

indices = ['lunes', 'martes', 'miercoles', 'jueves', 'viernes', 'sábado', 'domingo']

2. A partir de estas dos listas cread una Serie donde la variable "valores" sean los valores de la Serie y la variable indices sean los índices de la Serie.

In [16]:
serie1 = pd.Series(valores, indices)

In [17]:
serie1

lunes        35
martes       26
miercoles    29
jueves       31
viernes      44
sábado       34
domingo      74
dtype: int64

3. A partir de las dos listas anteriores cread un diccionario usando un bucle for. Para hacer esto tenemos el método zip que nos permite iterar por dos listas a la vez.

In [18]:
diccionario = {}

for i,z in zip(indices, valores):
    print(i, z) # Dejamos esta línea a modo de comprobación.
    diccionario[i] = z


print('El diccionario nos queda tal que así:', diccionario)

lunes 35
martes 26
miercoles 29
jueves 31
viernes 44
sábado 34
domingo 74
El diccionario nos queda tal que así: {'lunes': 35, 'martes': 26, 'miercoles': 29, 'jueves': 31, 'viernes': 44, 'sábado': 34, 'domingo': 74}

4. Crea una Serie con el diccionario creado en el punto anterior.

In [19]:
serie1 = pd.Series(diccionario)
print(serie1)

lunes        35
martes       26
miercoles    29
jueves       31
viernes      44
sábado       34
domingo      74
dtype: int64


- ¿Qué forma tiene esta última Serie?
- ¿Qué tipo de datos tiene?
- ¿Qué tamaño tiene?
- ¿Cuáles son los índices de la Serie?
- ¿Y los values?

In [20]:
# Actualizamos nuestra función:

def propiedades(nuestro_array):
    print(f'La forma de nuestro array es', nuestro_array.shape)
    print(f'El tipo de nuestro array es', nuestro_array.dtype)
    print(f'El tamaño de nuestro array es', nuestro_array.size)
    print(f'Los índices de nuestra serie son', nuestro_array.index)
    print(f'Los values de nuestra serie son', nuestro_array.values)

propiedades(serie1)

La forma de nuestro array es (7,)
El tipo de nuestro array es int64
El tamaño de nuestro array es 7
Los índices de nuestra serie son Index(['lunes', 'martes', 'miercoles', 'jueves', 'viernes', 'sábado',
       'domingo'],
      dtype='object')
Los values de nuestra serie son [35 26 29 31 44 34 74]

- Extraed el valor para el índice "lunes".

In [21]:

print(serie1['lunes'])

35

- Extraed el valor para el índice "lunes", "martes" y "miércoles".

In [22]:
print(serie1[0:3])

lunes        35
martes       26
miercoles    29
dtype: int64

- Extraed el valor para el índice "lunes" y "domingo".

In [23]:
# Preguntamos duda

print('Lunes y domingo:', serie1[["lunes","domingo"]])

Lunes y domingo: lunes      35
domingo    74
dtype: int64

5. Cread un array de dos dimensiones con 4 filas y 3 columnas.

In [24]:
array1 = np.random.rand(4, 3)
array1

array([[0.01793085, 0.56205531, 0.08715313],
       [0.65214041, 0.8347734 , 0.97760452],
       [0.33866874, 0.13323108, 0.13272412],
       [0.66910899, 0.00922985, 0.46947524]])

- Convertid el array en un DataFrame donde las columnas se llamen "España", "Francia" e "Italia".

In [25]:
dataframe1 = pd.DataFrame(array1, columns = ["España", "Francia", "Italia"])
dataframe1

     España   Francia    Italia
0  0.017931  0.562055  0.087153
1  0.652140  0.834773  0.977605
2  0.338669  0.133231  0.132724
3  0.669109  0.009230  0.469475

- Descargad el archivo "medallas" y cargad el DataFrame:

In [26]:
miruta = os.getcwd()
miruta

'/home/adalaber/Escritorio/Adalab/pairprogramming/DA-promoC-modulo-02-Marina-Lourdes-Ana/Pandas'

In [27]:
nuestro_df = pd.read_csv("datos/01-medallas.csv", index_col = ["País"])

In [28]:
nuestro_df

                 Unnamed: 0   Oro  Plata  Bronce
País
China                     1  1473    994     720
Japón                     2  1032   1037     985
Corea del Sur             3   745    663     827
Irán                      4   179    181     197
Kazajistán                5   155    158     224
India                     6   154    202     315
Tailandia                 7   132    175     278
Indonesia                 8   112    131     240
China Taipéi              9    99    144     276
Corea del Norte          10    91    120     235

- Usando el loc extraed todas las columnas de la fila.

In [29]:
# Elegimos la fila "Tailandia".

nuestro_df.loc["Tailandia"]

Unnamed: 0      7
Oro           132
Plata         175
Bronce        278
Name: Tailandia, dtype: int64

- Usando el loc extraed todas las columnas de China e Irán.

In [30]:
nuestro_df.loc[["China","Irán"]]

       Unnamed: 0   Oro  Plata  Bronce
País
China           1  1473    994     720
Irán            4   179    181     197

- Usando el loc extraed solo las columnas de "Oro", "Plata" y "Bronce" de China e Irán.

In [31]:
nuestro_df.loc[["China", "Irán"], ["Oro", "Plata", "Bronce"]]

        Oro  Plata  Bronce
País
China  1473    994     720
Irán    179    181     197

- Usando el iloc extraed la información de la India. Devolved todas las columnas.

In [32]:
nuestro_df.iloc[5]

Unnamed: 0      6
Oro           154
Plata         202
Bronce        315
Name: India, dtype: int64

- Usando el iloc extraed todas las columnas de los paises que estén en posición impar.

In [33]:
nuestro_df.iloc[0::2]

               Unnamed: 0   Oro  Plata  Bronce
País
China                   1  1473    994     720
Corea del Sur           3   745    663     827
Kazajistán              5   155    158     224
Tailandia               7   132    175     278
China Taipéi            9    99    144     276

La primera que nos tendría que salir es Japón y la última Corea del Norte.

Lo hacemos de dos maneras, primera:

In [34]:
nuestro_df.iloc[1::]

                 Unnamed: 0   Oro  Plata  Bronce
País
Japón                     2  1032   1037     985
Corea del Sur             3   745    663     827
Irán                      4   179    181     197
Kazajistán                5   155    158     224
India                     6   154    202     315
Tailandia                 7   132    175     278
Indonesia                 8   112    131     240
China Taipéi              9    99    144     276
Corea del Norte          10    91    120     235

Segunda:

In [35]:
nuestro_df.iloc[1:10]

                 Unnamed: 0   Oro  Plata  Bronce
País
Japón                     2  1032   1037     985
Corea del Sur             3   745    663     827
Irán                      4   179    181     197
Kazajistán                5   155    158     224
India                     6   154    202     315
Tailandia                 7   132    175     278
Indonesia                 8   112    131     240
China Taipéi              9    99    144     276
Corea del Norte          10    91    120     235

In [36]:
print("En ambos casos, es correcto.")

En ambos casos, es correcto.

6. Utilizando el código del ejercicio anterior, seleccionad unicamente las columnas "Oro", "Plata" y "Bronce". Contestad a las siguientes preguntas:

- ¿Qué país consiguió más de 200 medallas de oro?

In [37]:
print('El país que consiguió más de 200 medallas de oro fue', nuestro_df.loc[nuestro_df.Oro>200])

El país que consiguió más de 200 medallas de oro fue                Unnamed: 0   Oro  Plata  Bronce
País
China                   1  1473    994     720
Japón                   2  1032   1037     985
Corea del Sur           3   745    663     827

- ¿Qué país consiguió más de 200 medallas de oro y más de 1000 de plata?

In [38]:
print('El país que consiguió más de 200 medallas de oro y más de 1000 de plata fue', nuestro_df.loc[(nuestro_df.Oro>200) & (nuestro_df.Plata>1000)])

El país que consiguió más de 200 medallas de oro y más de 1000 de plata fue        Unnamed: 0   Oro  Plata  Bronce
País
Japón           2  1032   1037     985

- ¿Qué país consiguió más de 200 medallas de oro o más de 700 de bronce?

In [39]:
print('El país que consiguió má s de 200 medallas de oro y más de 1000 de plata fue', nuestro_df.loc[(nuestro_df.Oro>200) | (nuestro_df.Bronce>700)])

El país que consiguió má s de 200 medallas de oro y más de 1000 de plata fue                Unnamed: 0   Oro  Plata  Bronce
País
China                   1  1473    994     720
Japón                   2  1032   1037     985
Corea del Sur           3   745    663     827

- Como vemos hay una columna que se llama Unnamed: 0 que no nos interesa. Eliminad esa columna.

In [40]:
nuestro_df_sin_unnamed = nuestro_df.drop('Unnamed: 0', axis = 1)
nuestro_df_sin_unnamed

                  Oro  Plata  Bronce
País
China            1473    994     720
Japón            1032   1037     985
Corea del Sur     745    663     827
Irán              179    181     197
Kazajistán        155    158     224
India             154    202     315
Tailandia         132    175     278
Indonesia         112    131     240
China Taipéi       99    144     276
Corea del Norte    91    120     235

- Cread una nueva columma que se llame "total" que sea el resultado de la suma de todas las medallas obtenidas por cada país.

In [41]:
nuestro_df_sin_unnamed['Total'] = (nuestro_df["Oro"] + nuestro_df["Plata"] + nuestro_df["Plata"])

In [42]:
nuestro_df_sin_unnamed

                  Oro  Plata  Bronce  Total
País
China            1473    994     720   3461
Japón            1032   1037     985   3106
Corea del Sur     745    663     827   2071
Irán              179    181     197    541
Kazajistán        155    158     224    471
India             154    202     315    558
Tailandia         132    175     278    482
Indonesia         112    131     240    374
China Taipéi       99    144     276    387
Corea del Norte    91    120     235    331